// shadow
// 0:極小
// 1:小
// 2:中
// 3:大
// 4:特大
// 5:ヒレ
// 6:長い

const json = '\
[{\
        "name": "たなご",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_1_i.png",\
        "season":[1,2,3,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "おいかわ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_2_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"川"\
    },\
    {\
        "name": "フナ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_3_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "ウグイ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_4_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "コイ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_5_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"池"\
    },\
    {\
        "name": "ニシキゴイ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_6_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"池"\
    },\
    {\
        "name": "キンギョ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_7_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"池"\
    },\
    {\
        "name": "デメキン",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_8_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"池"\
    },\
    {\
        "name": "ランチュウ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_9_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"池"\
    },\
    {\
        "name": "メダカ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_10_i.png",\
        "season":[4,5,6,7,8],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"池"\
    },\
    {\
        "name": "ザリガニ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_11_i.png",\
        "season":[4,5,6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"池"\
    },\
    {\
        "name": "スッポン",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_12_i.png",\
        "season":[8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "カミツキガメ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_13_i.png",\
        "season":[4,5,6,7,8,9,10],\
        "time":[0,1,2,3,4,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "オタマジャクシ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_14_i.png",\
        "season":[3,4,5,6,7],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"池"\
    },\
    {\
        "name": "カエル",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_15_i.png",\
        "season":[5,6,7,8],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"池"\
    },\
    {\
        "name": "ドンコ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_16_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "ドジョウ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_17_i.png",\
        "season":[3,4,5],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "ナマズ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_18_i.png",\
        "season":[5,6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"池"\
    },\
    {\
        "name": "ライギョ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_19_i.png",\
        "season":[6,7,8],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"池"\
    },\
    {\
        "name": "ブルーギル",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_20_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"川"\
    },\
    {\
        "name": "イエローパーチ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_21_i.png",\
        "season":[1,2,3,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "ブラックバス",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_22_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "ティラピア",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_23_i.png",\
        "season":[6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "パイク",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_24_i.png",\
        "season":[9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "ワカサギ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_25_i.png",\
        "season":[1,2,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "アユ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_26_i.png",\
        "season":[7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "ヤマメ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_27_i.png",\
        "season":[3,4,5,6,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"崖の上"\
    },\
    {\
        "name": "オオイワナ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_28_i.png",\
        "season":[3,4,5,6,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"崖の上"\
    },\
    {\
        "name": "ゴールデントラウト",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_29_i.png",\
        "season":[3,4,5,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"崖の上"\
    },\
    {\
        "name": "イトウ",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_30_i.png",\
        "season":[1,2,3,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"崖の上"\
    },\
    {\
        "name": "サケ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_31_i.png",\
        "season":[9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"河口"\
    },\
    {\
        "name": "キングサーモン",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_32_i.png",\
        "season":[9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"河口"\
    },\
    {\
        "name": "シャンハイガニ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_33_i.png",\
        "season":[9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "グッピー",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_34_i.png",\
        "season":[4,5,6,7,8,9,10,11],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"川"\
    },\
    {\
        "name": "ドクターフィッシュ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_35_i.png",\
        "season":[5,6,7,8,9],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"川"\
    },\
    {\
        "name": "エンゼルフィッシュ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_36_i.png",\
        "season":[5,6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "ベタ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_37_i.png",\
        "season":[5,6,7,8,9,10],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"川"\
    },\
    {\
        "name": "ネオンテトラ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_38_i.png",\
        "season":[4,5,6,7,8,9,10,11],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"川"\
    },\
    {\
        "name": "レインボーフィッシュ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_39_i.png",\
        "season":[5,6,7,8,9,10],\
        "time":[9,10,11,12,13,14,15,16],\
        "place":"川"\
    },\
    {\
        "name": "ピラニア",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_40_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,9,10,11,12,13,14,15,16,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "アロワナ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_41_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "ドラド",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_42_i.png",\
        "season":[6,7,8,9],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21],\
        "place":"川"\
    },\
    {\
        "name": "ガー",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_43_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"池"\
    },\
    {\
        "name": "ピラルク",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_44_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "エンドリケリー",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_45_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,21,22,23,24],\
        "place":"川"\
    },\
    {\
        "name": "チョウザメ",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_46_i.png",\
        "season":[1,2,3,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"河口"\
    },\
    {\
        "name": "クリオネ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_47_i.png",\
        "season":[1,2,3,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "タツノオトシゴ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_48_i.png",\
        "season":[4,5,6,7,8,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "クマノミ",\
        "shadow": 0,\
        "type": "fish",\
        "img": "sakana_49_i.png",\
        "season":[4,5,6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "ナンヨウハギ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_50_i.png",\
        "season":[4,5,6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "チョウチョウウオ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_51_i.png",\
        "season":[4,5,6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "ナポレオンフィッシュ",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_52_i.png",\
        "season":[7,8],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21],\
        "place":"海"\
    },\
    {\
        "name": "ミノカサゴ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_53_i.png",\
        "season":[4,5,6,7,8,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "フグ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_54_i.png",\
        "season":[1,2,11,12],\
        "time":[0,1,2,3,4,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "ハリセンボン",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_55_i.png",\
        "season":[7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "アンチョビ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_56_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21],\
        "place":"海"\
    },\
    {\
        "name": "アジ",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_57_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "イシダイ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_58_i.png",\
        "season":[3,4,5,6,7,8,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "スズキ",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_59_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "タイ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_60_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "カレイ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_61_i.png",\
        "season":[1,2,3,4,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "ヒラメ",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_62_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "イカ",\
        "shadow": 2,\
        "type": "fish",\
        "img": "sakana_63_i.png",\
        "season":[1,2,3,4,5,6,7,8,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "ウツボ",\
        "shadow": 6,\
        "type": "fish",\
        "img": "sakana_64_i.png",\
        "season":[8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "ハナヒゲウツボ",\
        "shadow": 6,\
        "type": "fish",\
        "img": "sakana_65_i.png",\
        "season":[6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "マグロ",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_66_i.png",\
        "season":[1,2,3,4,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"桟橋"\
    },\
    {\
        "name": "カジキ",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_67_i.png",\
        "season":[1,2,3,4,7,8,9,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"桟橋"\
    },\
    {\
        "name": "ロウニンアジ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_68_i.png",\
        "season":[5,6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"桟橋"\
    },\
    {\
        "name": "シイラ",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_69_i.png",\
        "season":[5,6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"桟橋"\
    },\
    {\
        "name": "マンボウ",\
        "shadow": 5,\
        "type": "fish",\
        "img": "sakana_70_i.png",\
        "season":[7,8,9],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21],\
        "place":"海"\
    },\
    {\
        "name": "エイ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_71_i.png",\
        "season":[8,9,10,11],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21],\
        "place":"海"\
    },\
    {\
        "name": "ノコギリザメ",\
        "shadow": 5,\
        "type": "fish",\
        "img": "sakana_72_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "シュモクザメ",\
        "shadow": 5,\
        "type": "fish",\
        "img": "sakana_73_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "サメ",\
        "shadow": 5,\
        "type": "fish",\
        "img": "sakana_74_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "ジンベエザメ",\
        "shadow": 5,\
        "type": "fish",\
        "img": "sakana_75_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "コバンザメ",\
        "shadow": 5,\
        "type": "fish",\
        "img": "sakana_76_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "チョウチンアンコウ",\
        "shadow": 3,\
        "type": "fish",\
        "img": "sakana_77_i.png",\
        "season":[1,2,3,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "リュウグウノツカイ",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_78_i.png",\
        "season":[1,2,3,4,5,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "デメニギス",\
        "shadow": 1,\
        "type": "fish",\
        "img": "sakana_79_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,21,22,23,24],\
        "place":"海"\
    },\
    {\
        "name": "シーラカンス",\
        "shadow": 4,\
        "type": "fish",\
        "img": "sakana_80_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"海"\
    }\
]';


const mushi_json = '\
[{\
        "name": "モンシロチョウ",\
        "type": "mushi",\
        "img": "musi_1_i.png",\
        "season":[1,2,3,4,5,6,9,10,11,12],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"花/空中"\
    },\
    {\
        "name": "モンキチョウ",\
        "type": "mushi",\
        "img": "musi_2_i.png",\
        "season":[3,4,5,6,9,10],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"花/空中"\
    },\
    {\
        "name": "アゲハチョウ",\
        "type": "mushi",\
        "img": "musi_3_i.png",\
        "season":[3,4,5,6,7,8,9],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"花/空中"\
    },\
    {\
        "name": "カラスアゲハ",\
        "type": "mushi",\
        "img": "musi_4_i.png",\
        "season":[3,4,5,6],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"花(黒/紫/青)/空中"\
    },\
    {\
        "name": "アオスジアゲハ",\
        "type": "mushi",\
        "img": "musi_5_i.png",\
        "season":[4,5,6,7,8],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"花/空中"\
    },\
    {\
        "name": "オオゴマダラ",\
        "type": "mushi",\
        "img": "musi_6_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"花/空中"\
    },\
    {\
        "name": "オオムラサキ",\
        "type": "mushi",\
        "img": "musi_7_i.png",\
        "season":[5,6,7,8],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"花/空中"\
    },\
    {\
        "name": "オオカバマダラ",\
        "type": "mushi",\
        "img": "musi_8_i.png",\
        "season":[9,10,11],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17],\
        "place":"花/空中"\
    },\
    {\
        "name": "モルフォチョウ",\
        "type": "mushi",\
        "img": "musi_9_i.png",\
        "season":[1,2,3,6,7,8,9,12],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"花/空中"\
    },\
    {\
        "name": "ミイロタテハ",\
        "type": "mushi",\
        "img": "musi_10_i.png",\
        "season":[4,5,6,7,8,9],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"花/空中"\
    },\
    {\
        "name": "アカエリトリバネアゲハ",\
        "type": "mushi",\
        "img": "musi_11_i.png",\
        "season":[1,2,4,5,6,7,8,9,12],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"花/空中"\
    },\
    {\
        "name": "アレキサンドラトリバネアゲハ",\
        "type": "mushi",\
        "img": "musi_12_i.png",\
        "season":[5,6,7,8,9],\
        "time":[8,9,10,11,12,13,14,15,16],\
        "place":"花/空中"\
    },\
    {\
        "name": "ガ",\
        "type": "mushi",\
        "img": "musi_13_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,19,20,21,22,23,24],\
        "place":"灯りの近く"\
    },\
    {\
        "name": "ヨナグニサン",\
        "type": "mushi",\
        "img": "musi_14_i.png",\
        "season":[4,5,6,7,8,9],\
        "time":[0,1,2,3,4,19,20,21,22,23,24],\
        "place":"木/ヤシの木"\
    },\
    {\
        "name": "ニシキオオツバメガ",\
        "type": "mushi",\
        "img": "musi_15_i.png",\
        "season":[4,5,6,7,8,9],\
        "time":[8,9,10,11,12,13,14,15,16],\
        "place":"空中"\
    },\
    {\
        "name": "ショウリョウバッタ",\
        "type": "mushi",\
        "img": "musi_16_i.png",\
        "season":[4,5,6,7,8,9,10,11],\
        "time":[8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"地上"\
    },\
    {\
        "name": "トノサマバッタ",\
        "type": "mushi",\
        "img": "musi_17_i.png",\
        "season":[8,9,10,11],\
        "time":[8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"地上"\
    },\
    {\
        "name": "イナゴ",\
        "type": "mushi",\
        "img": "musi_18_i.png",\
        "season":[8,9,10,11],\
        "time":[8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"地上"\
    },\
    {\
        "name": "キリギリス",\
        "type": "mushi",\
        "img": "musi_19_i.png",\
        "season":[7,8,9],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"地上"\
    },\
    {\
        "name": "コオロギ",\
        "type": "mushi",\
        "img": "musi_20_i.png",\
        "season":[9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "スズムシ",\
        "type": "mushi",\
        "img": "musi_21_i.png",\
        "season":[9,10],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "カマキリ",\
        "type": "mushi",\
        "img": "musi_22_i.png",\
        "season":[3,4,5,6,7,8,9,10,11],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"花の上"\
    },\
    {\
        "name": "ハナカマキリ",\
        "type": "mushi",\
        "img": "musi_23_i.png",\
        "season":[3,4,5,6,7,8,9,10,11],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"花の上"\
    },\
    {\
        "name": "ミツバチ",\
        "type": "mushi",\
        "img": "musi_24_i.png",\
        "season":[3,4,5,6,7],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"花の近く"\
    },\
    {\
        "name": "ハチ",\
        "type": "mushi",\
        "img": "musi_25_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"木"\
    },\
    {\
        "name": "アブラゼミ",\
        "type": "mushi",\
        "img": "musi_26_i.png",\
        "season":[7,8],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"木"\
    },\
    {\
        "name": "ミンミンゼミ",\
        "type": "mushi",\
        "img": "musi_27_i.png",\
        "season":[7,8],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"木"\
    },\
    {\
        "name": "クマゼミ",\
        "type": "mushi",\
        "img": "musi_28_i.png",\
        "season":[7,8],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"木"\
    },\
    {\
        "name": "ツクツクホウシ",\
        "type": "mushi",\
        "img": "musi_29_i.png",\
        "season":[8,9],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"木"\
    },\
    {\
        "name": "ヒグラシ",\
        "type": "mushi",\
        "img": "musi_30_i.png",\
        "season":[7,8],\
        "time":[4,5,6,7,8,16,17,18,19],\
        "place":"木"\
    },\
    {\
        "name": "セミのぬけがら",\
        "type": "mushi",\
        "img": "musi_31_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"木"\
    },\
    {\
        "name": "アキアカネ",\
        "type": "mushi",\
        "img": "musi_32_i.png",\
        "season":[9,10],\
        "time":[8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"空中"\
    },\
    {\
        "name": "ギンヤンマ",\
        "type": "mushi",\
        "img": "musi_33_i.png",\
        "season":[4,5,6,7,8,9,10],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"空中"\
    },\
    {\
        "name": "オニヤンマ",\
        "type": "mushi",\
        "img": "musi_34_i.png",\
        "season":[5,6,7,8,9,10],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"空中"\
    },\
    {\
        "name": "イトトンボ",\
        "type": "mushi",\
        "img": "musi_35_i.png",\
        "season":[1,2,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"空中"\
    },\
    {\
        "name": "ホタル",\
        "type": "mushi",\
        "img": "musi_36_i.png",\
        "season":[6],\
        "time":[0,1,2,3,4,19,20,21,22,23,24],\
        "place":"空中"\
    },\
    {\
        "name": "オケラ",\
        "type": "mushi",\
        "img": "musi_37_i.png",\
        "season":[1,2,3,4,5,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "アメンボ",\
        "type": "mushi",\
        "img": "musi_38_i.png",\
        "season":[5,6,7,8,9],\
        "time":[8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"水面"\
    },\
    {\
        "name": "ゲンゴロウ",\
        "type": "mushi",\
        "img": "musi_39_i.png",\
        "season":[5,6,7,8,9],\
        "time":[8,9,10,11,12,13,14,15,16,17,18,19],\
        "place":"水面"\
    },\
    {\
        "name": "タガメ",\
        "type": "mushi",\
        "img": "musi_40_i.png",\
        "season":[4,5,6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,19,20,21,22,23,24],\
        "place":"水面"\
    },\
    {\
        "name": "カメムシ",\
        "type": "mushi",\
        "img": "musi_41_i.png",\
        "season":[3,4,5,6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"花の上"\
    },\
    {\
        "name": "ジンメンカメムシ",\
        "type": "mushi",\
        "img": "musi_42_i.png",\
        "season":[3,4,5,6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,19,20,21,22,23,24],\
        "place":"花の上"\
    },\
    {\
        "name": "テントウムシ",\
        "type": "mushi",\
        "img": "musi_43_i.png",\
        "season":[3,4,5,6,10],\
        "time":[8,9,10,11,12,13,14,15,16,17],\
        "place":"花の上"\
    },\
    {\
        "name": "ハンミョウ",\
        "type": "mushi",\
        "img": "musi_44_i.png",\
        "season":[2,3,4,5,6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "タマムシ",\
        "type": "mushi",\
        "img": "musi_45_i.png",\
        "season":[4,5,6,7,8],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"切り株の上"\
    },\
    {\
        "name": "バイオリンムシ",\
        "type": "mushi",\
        "img": "musi_46_i.png",\
        "season":[5,6,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"切り株の上"\
    },\
    {\
        "name": "ゴマダラカミキリ",\
        "type": "mushi",\
        "img": "musi_47_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"切り株の上"\
    },\
    {\
        "name": "ルリボシカミキリ",\
        "type": "mushi",\
        "img": "musi_48_i.png",\
        "season":[5,6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"切り株の上"\
    },\
    {\
        "name": "ホウセキゾウムシ",\
        "type": "mushi",\
        "img": "musi_49_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"ヤシの木"\
    },\
    {\
        "name": "フンコロガシ",\
        "type": "mushi",\
        "img": "musi_50_i.png",\
        "season":[1,2,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"雪玉を転がしている"\
    },\
    {\
        "name": "オオセンチコガネ",\
        "type": "mushi",\
        "img": "musi_51_i.png",\
        "season":[7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "プラチナコガネ",\
        "type": "mushi",\
        "img": "musi_52_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,23,24],\
        "place":"木/ヤシの木"\
    },\
    {\
        "name": "カナブン",\
        "type": "mushi",\
        "img": "musi_53_i.png",\
        "season":[6,7,8],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"木/ヤシの木"\
    },\
    {\
        "name": "ゴライアスオオツノハナムグリ",\
        "type": "mushi",\
        "img": "musi_54_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"ヤシの木"\
    },\
    {\
        "name": "ノコギリクワガタ",\
        "type": "mushi",\
        "img": "musi_55_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"木/ヤシの木"\
    },\
    {\
        "name": "ミヤマクワガタ",\
        "type": "mushi",\
        "img": "musi_56_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"木/ヤシの木"\
    },\
    {\
        "name": "オオクワガタ",\
        "type": "mushi",\
        "img": "musi_57_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,23,24],\
        "place":"木/ヤシの木"\
    },\
    {\
        "name": "ニジイロクワガタ",\
        "type": "mushi",\
        "img": "musi_58_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,19,20,21,22,23,24],\
        "place":"木/ヤシの木"\
    },\
    {\
        "name": "ホソアカクワガタ",\
        "type": "mushi",\
        "img": "musi_59_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"ヤシの木"\
    },\
    {\
        "name": "オウゴンオニクワガタ",\
        "type": "mushi",\
        "img": "musi_60_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"ヤシの木"\
    },\
    {\
        "name": "ギラファノコギリクワガタ",\
        "type": "mushi",\
        "img": "musi_61_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"ヤシの木"\
    },\
    {\
        "name": "カブトムシ",\
        "type": "mushi",\
        "img": "musi_62_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"木/ヤシの木"\
    },\
    {\
        "name": "コーカサスオオカブト",\
        "type": "mushi",\
        "img": "musi_63_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"ヤシの木"\
    },\
    {\
        "name": "ゾウカブト",\
        "type": "mushi",\
        "img": "musi_64_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"ヤシの木"\
    },\
    {\
        "name": "ヘラクレスオオカブト",\
        "type": "mushi",\
        "img": "musi_65_i.png",\
        "season":[7,8],\
        "time":[0,1,2,3,4,5,6,7,8,17,18,19,20,21,22,23,24],\
        "place":"ヤシの木"\
    },\
    {\
        "name": "ナナフシ",\
        "type": "mushi",\
        "img": "musi_66_i.png",\
        "season":[7,8,9,10,11],\
        "time":[4,5,6,7,8,17,18,19],\
        "place":"木/ヤシの木"\
    },\
    {\
        "name": "コノハムシ",\
        "type": "mushi",\
        "img": "musi_67_i.png",\
        "season":[7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "ミノムシ",\
        "type": "mushi",\
        "img": "musi_68_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"木"\
    },\
    {\
        "name": "アリ",\
        "type": "mushi",\
        "img": "musi_69_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "ヤドカリ",\
        "type": "mushi",\
        "img": "musi_70_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,19,20,21,22,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "フナムシ",\
        "type": "mushi",\
        "img": "musi_71_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"岩礁"\
    },\
    {\
        "name": "ハエ",\
        "type": "mushi",\
        "img": "musi_72_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"空中"\
    },\
    {\
        "name": "カ",\
        "type": "mushi",\
        "img": "musi_73_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,17,18,19,20,21,22,23,24],\
        "place":"空中"\
    },\
    {\
        "name": "ノミ",\
        "type": "mushi",\
        "img": "musi_74_i.png",\
        "season":[4,5,6,7,8,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"住民の体"\
    },\
    {\
        "name": "カタツムリ",\
        "type": "mushi",\
        "img": "musi_75_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],\
        "place":"石/低木"\
    },\
    {\
        "name": "ダンゴムシ",\
        "type": "mushi",\
        "img": "musi_76_i.png",\
        "season":[1,2,3,4,5,6,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "ムカデ",\
        "type": "mushi",\
        "img": "musi_77_i.png",\
        "season":[1,2,3,4,5,6,9,10,11,12],\
        "time":[16,17,18,19,20,21,22,23],\
        "place":"地上"\
    },\
    {\
        "name": "クモ",\
        "type": "mushi",\
        "img": "musi_78_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,19,20,21,22,23,24],\
        "place":"木"\
    },\
    {\
        "name": "タランチュラ",\
        "type": "mushi",\
        "img": "musi_79_i.png",\
        "season":[1,2,3,4,11,12],\
        "time":[0,1,2,3,4,19,20,21,22,23,24],\
        "place":"地上"\
    },\
    {\
        "name": "サソリ",\
        "type": "mushi",\
        "img": "musi_80_i.png",\
        "season":[5,6,7,8,9,10],\
        "time":[0,1,2,3,4,19,20,21,22,23,24],\
        "place":"地上"\
    }\
]';

const kaisan_json = '\
[{\
        "name": "わかめ",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_1_i.png",\
        "season":[1,2,3,4,5,6,7,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ウミブドウ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_2_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ナマコ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_3_i.png",\
        "season":[1,2,3,4,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "センジュナマコ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_4_i.png",\
        "season":[1,2,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ヒトデ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_5_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ウニ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_6_i.png",\
        "season":[5,6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "パイプウニ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_7_i.png",\
        "season":[5,6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "イソギンチャク",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_8_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ミズクラゲ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_9_i.png",\
        "season":[7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ウミウシ",\
        "shadow": 0,\
        "type": "kaisan",\
        "img": "seafood_10_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "アコヤガイ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_11_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ムールガイ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_12_i.png",\
        "season":[6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "オイスター",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_13_i.png",\
        "season":[1,2,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ホタテ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_14_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "バイガイ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_15_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "サザエ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_16_i.png",\
        "season":[3,4,5,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "アワビ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_17_i.png",\
        "season":[1,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "オオシャコガイ",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_18_i.png",\
        "season":[5,6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "オウムガイ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_19_i.png",\
        "season":[3,4,5,6,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "タコ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_20_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "メンダコ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_21_i.png",\
        "season":[3,4,5,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "コウモリダコ",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_22_i.png",\
        "season":[5,6,7,8],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ホタルイカ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_23_i.png",\
        "season":[3,4,5,6],\
        "time":[0,1,2,3,4,21,22,23,24]\
    },\
    {\
        "name": "ガザミ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_24_i.png",\
        "season":[6,7,8,9,10,11],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ダンジネスクラブ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_25_i.png",\
        "season":[1,2,3,4,5,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ズワイガニ",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_26_i.png",\
        "season":[1,2,3,4,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "タラバガニ",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_27_i.png",\
        "season":[1,2,3,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "フジツボ",\
        "shadow": 0,\
        "type": "kaisan",\
        "img": "seafood_28_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "タカアシガニ",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_29_i.png",\
        "season":[3,4],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "クルマエビ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_30_i.png",\
        "season":[6,7,8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "アマエビ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_31_i.png",\
        "season":[1,2,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "シャコ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_32_i.png",\
        "season":[1,2,3,4,5,6,7,8,9,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "イセエビ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_33_i.png",\
        "season":[10,11,12],\
        "time":[0,1,2,3,4,21,22,23,24]\
    },\
    {\
        "name": "ロブスター",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_34_i.png",\
        "season":[1,4,5,6,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ダイオウグソクムシ",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_35_i.png",\
        "season":[1,2,3,4,7,8,9,10],\
        "time":[0,1,2,3,4,9,10,11,12,13,14,15,16,21,22,23,24]\
    },\
    {\
        "name": "カブトガニ",\
        "shadow": 2,\
        "type": "kaisan",\
        "img": "seafood_36_i.png",\
        "season":[7,8,9],\
        "time":[0,1,2,3,4,21,22,23,24]\
    },\
    {\
        "name": "ホヤ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_37_i.png",\
        "season":[4,5,6,7,8],\
        "time":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21]\
    },\
    {\
        "name": "チンアナゴ",\
        "shadow": 1,\
        "type": "kaisan",\
        "img": "seafood_38_i.png",\
        "season":[5,6,7,8,9,10],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "ヒラムシ",\
        "shadow": 0,\
        "type": "kaisan",\
        "img": "seafood_39_i.png",\
        "season":[8,9],\
        "time":[0,1,2,3,4,5,6,7,8,9,16,17,18,19,20,21,22,23,24]\
    },\
    {\
        "name": "カイロウドウケツ",\
        "shadow": 3,\
        "type": "kaisan",\
        "img": "seafood_40_i.png",\
        "season":[1,2,10,11,12],\
        "time":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]\
    }\
]';

function CreateFishTable(json)
{
    const data = JSON.parse(json);

    // 現在参照中の月を生成。
    var currentDate = new Date();
    var targetDate = new Date(currentDate.getFullYear(), nowMonth, currentDate.getDate());

    var count = 0;
    for (var info of data) {
        var name = info.name;
        var imgName = info.img;
        var type = info.type;
        var place = info.place;
        var shadow = info.shadow;
        var shadowNameList = ["極小", "小",  "中",  "大",  "特大",  "背びれ",  "細長"];
        var shadowName = shadowNameList[shadow];
        var seasonText = MakeSeasonText(info.season, "月");
        var timeText = MakeSeasonText(info.time, "時");
        var thisMonth = CheckThisMonth(info.season, targetDate);// 今月までフラグ。
        var thisMonthPop = CheckThisMonthPop(info.season, targetDate); // 今月出現するフラグ。
        var nowPop = CheckNowPop(info.time) ? '<br><font color="FF0000">出現中</font>' : '';
        var nowPopClass = CheckNowPop(info.time) ? 'table-info' : '';

        var html = `
        <tr class="table_row ${thisMonth} ${thisMonthPop}" name='${type}${count}'>
          <td class="align-middle ${nowPopClass}">
                <input type="hidden" name='${type}${count}' class="kizou_check" id="${type}_check">
                <img src="./images/${type}/${imgName}" alt="${name}" class="img-thumbnail" width="59px"><br>
                ${name}
                ${nowPop}
          </td>
          <td class="align-middle">
                <img src="./images/${type}/shadow/${shadow}.png" alt="" class="img-thumbnail" width="50px"><br>
                ${shadowName}
          </td>
          <td class="align-middle">${place}</td>
          <td class="align-middle">${seasonText}</td>
          <td class="align-middle">${timeText}</td>
        </tr>
        `

        $('#fish_table').append(html);
        count++;
    }
}

function CreateMushiTable(json)
{
    const data = JSON.parse(json);

    // 現在参照中の月を生成。
    var currentDate = new Date();
    var targetDate = new Date(currentDate.getFullYear(), nowMonth, currentDate.getDate());

    var count = 0;
    for (var info of data) {
        var name = info.name;
        var imgName = info.img;
        var type = info.type;
        var place = info.place;
        var seasonText = MakeSeasonText(info.season, "月");
        var timeText = MakeSeasonText(info.time, "時");
        var thisMonth = CheckThisMonth(info.season, targetDate);// 今月までフラグ。
        var thisMonthPop = CheckThisMonthPop(info.season, targetDate); // 今月出現するフラグ。
        var nowPop = CheckNowPop(info.time) ? '<br><font color="FF0000">出現中</font>' : '';
        var nowPopClass = CheckNowPop(info.time) ? 'table-info' : '';

        var html = `
        <tr class="table_row ${thisMonth} ${thisMonthPop}" name='${type}${count}'>
          <td class="align-middle ${nowPopClass}">
                <input type="hidden" name='${type}${count}' class="kizou_check" id="${type}_check">
                <img src="./images/${type}/${imgName}" alt="${name}" class="img-thumbnail" width="59px"><br>
                ${name}
                ${nowPop}
          </td>
          <td class="align-middle">${place}</td>
          <td class="align-middle">${seasonText}</td>
          <td class="align-middle">${timeText}</td>
        </tr>
        `

        $('#mushi_table').append(html);
        count++;
    }
}

function CreateKaisanTable(json)
{
    const data = JSON.parse(json);

    // 現在参照中の月を生成。
    var currentDate = new Date();
    var targetDate = new Date(currentDate.getFullYear(), nowMonth, currentDate.getDate());

    var count = 0;
    for (var info of data) {
        var name = info.name;
        var imgName = info.img;
        var type = info.type;
        var shadow = info.shadow;
        var shadowNameList = ["極小", "小",  "中",  "大",  "特大",  "背びれ",  "細長"];
        var shadowName = shadowNameList[shadow];
        var seasonText = MakeSeasonText(info.season, "月");
        var timeText = MakeSeasonText(info.time, "時");
        var thisMonth = CheckThisMonth(info.season, targetDate);// 今月までフラグ。
        var thisMonthPop = CheckThisMonthPop(info.season, targetDate); // 今月出現するフラグ。
        var nowPop = CheckNowPop(info.time) ? '<br><font color="FF0000">出現中</font>' : '';
        var nowPopClass = CheckNowPop(info.time) ? 'table-info' : '';

        var html = `
        <tr class="table_row ${thisMonth} ${thisMonthPop}" name='${type}${count}'>
          <td class="align-middle ${nowPopClass}">
                <input type="hidden" name='${type}${count}' class="kizou_check" id="${type}_check">
                <img src="./images/${type}/${imgName}" alt="${name}" class="img-thumbnail" width="59px"><br>
                ${name}
                ${nowPop}
          </td>
          <td class="align-middle">
                <img src="./images/${type}/shadow/${shadow}.png" alt="" class="img-thumbnail" width="50px"><br>
                ${shadowName}
          </td>
          <td class="align-middle">${seasonText}</td>
          <td class="align-middle">${timeText}</td>
        </tr>
        `

        $('#kaisan_table').append(html);
        count++;
    }
}

// すべてのテーブルの要素を消す。
function ClearAllTable()
{
    $('#fish_table').empty();
    $('#mushi_table').empty();
    $('#kaisan_table').empty();
}

// 現在の時間に出現するか。
function CheckNowPop(array)
{
    var today = new Date();
    var pop = array.indexOf(today.getHours());
    return (pop >= 0);
}

function CheckThisMonthPop(array, date)
{
    // 今月まで。
    var today = date;
    var thisMonth = (today.getMonth()+1);

    // 今月出現する。
    var thisMonthResult = array.indexOf(thisMonth);

    if(thisMonthResult >= 0)
    {
        return "";
    }
    return "NotThisMonthPop";
}

function CheckThisMonth(array, date)
{
    // 今月まで。
    var today = date;
    var thisMonth = (today.getMonth()+1);

    // 来月。
    var next = new Date(today.getFullYear(), today.getMonth()+1, today.getDate());
    var nextMonth = (next.getMonth()+1);

    // まず今月出現する。
    var thisMonthResult = array.indexOf(thisMonth);

    // 来月は出現しない。
    var nextMonthResult = array.indexOf(nextMonth);
    
    // 今月まで。
    if(thisMonthResult >= 0 && nextMonthResult == -1)
    {
        return "";
    }
    return "NotThisMonth";
}

function MakeSeasonText(array, tanni)
{
    var first = false;
    var oldMonth = -1;
    var text = "";

    if(tanni == "月")
    {
        if(array.length == 12)
        {
            return "いつでも"
        }
    }
    else if(tanni == "時")
    {
        if(array.length == 25)
        {
            return "いつでも"
        }
    }

    var tmpStartMonth = "";
    var tmpEndMonth = "";
    for(var month of array)
    {
        // 初回は無条件で月を入れる。
        if (!first)
        {
            tmpStartMonth = month + tanni;
            first = true;
        }
        // 連続した月。
        else if (month - oldMonth == 1)
        {
            tmpEndMonth = month + tanni;
        }
        else
        {
            if (tmpStartMonth !== "" && tmpEndMonth !== "")
            {
                text += tmpStartMonth + "〜" + tmpEndMonth + "<br>";
            }
            else if(tmpStartMonth !== "")
            {
                text += tmpStartMonth + ",";
            }
            tmpStartMonth = month + tanni;
            tmpEndMonth = "";
        }
        oldMonth = month;
    }

    if (tmpStartMonth !== "" && tmpEndMonth !== "")
    {
        text += tmpStartMonth + "〜" + tmpEndMonth;
    }
    else if(tmpStartMonth !== "")
    {
        text += tmpStartMonth;
    }

    return text;
}

// 描画切り替え。
function CheckVisible()
{
    // とりあえず全部表示。
    $('.table_row').show();

    // 今月までチェック。今月までじゃないやつを消す。
    var thisMonthPop = $('#setting_this_month_pop').prop('checked');
    if(thisMonthPop)
    {
        $('.NotThisMonthPop').hide();
    }

    // 今月までチェック。今月までじゃないやつを消す。
    var thisMonth = $('#setting_this_month').prop('checked');
    if(thisMonth)
    {
        $('.NotThisMonth').hide();
    }

    // 寄贈チェック。寄贈済のやつを消す。
    var kizou = $('#setting_kizou_check').prop('checked');

    // 寄贈済は色を変える。
    $('.kizou_check').each(function(index, element) {
        if($(this).prop('checked'))
        {
            $(this).parent().parent().addClass("table-secondary");
            // 消すチェックがついている場合は消す。
            if(kizou)
            {
                $(this).parent().parent().hide();
            }
        }
        else
        {
            $(this).parent().parent().removeClass("table-secondary");
        }
    })
}

function saveAllParam()
{
    var saveData = {};

    // チェック状態を保存。
    $('.kizou_check').each(function(index, element) {
        var name = $(this).attr('name');
        saveData[name] = $(this).prop('checked');
    })

    // 各種設定を保存。
    var thisMonth = $('#setting_this_month').prop('checked');
    saveData["setting_this_month"] = thisMonth;

    var thisMonthPop = $('#setting_this_month_pop').prop('checked');
    saveData["setting_this_month_pop"] = thisMonthPop;

    var kizou = $('#setting_kizou_check').prop('checked');
    saveData["setting_kizou_check"] = kizou;

    store.set('user_data', saveData);
}

function loadAllParam()
{
    var saveData = store.get('user_data');

    // データが存在するならせっせとフォームにセットしにいく。
    if (!saveData)
    {
        return;
    }

    // 各データのチェック状態を復活。
    for (let key in saveData) {
      $('input[name='+key+']').prop('checked', saveData[key]);
    }

    // 各種設定を読み込み。
    $('#setting_this_month').prop('checked', saveData["setting_this_month"]);

    $('#setting_this_month_pop').prop('checked', saveData["setting_this_month_pop"]);

    $('#setting_kizou_check').prop('checked', saveData["setting_kizou_check"]);
}

// 初期値は今月を入れておく。1少ない値になるので注意。
var today = new Date();
nowMonth = today.getMonth();

function initialize()
{
    $('.kongetsu').html('<strong>'+(nowMonth+1)+'月出現中のみ表示</strong>');
    $('.kongetsu_made').html('<strong>'+(nowMonth+1)+'月までのみ表示</strong>');

    ClearAllTable();

    CreateFishTable(json);
    CreateMushiTable(mushi_json);
    CreateKaisanTable(kaisan_json);

    // 前回のデータ読み込み。
    loadAllParam();

    // 表示チェック。
    CheckVisible();

    // テーブルタッチ。テーブルはあとから生まれるのでこのタイミングでセット。
    $(".table_row").click(function() {

        // フラグを反転させる。
        var key = $(this).find('input').attr('name');
        var flag = $('input[name='+key+']').prop('checked');
        $('input[name='+key+']').prop('checked', !flag);


        CheckVisible();    
        saveAllParam();
    });
}

// 今月チェック。
$('#setting_this_month_pop').click(function() {
    CheckVisible();    
    saveAllParam();
});

$('#setting_this_month').click(function() {
    CheckVisible();    
    saveAllParam();
});

// 寄贈済チェック。
$('#setting_kizou_check').click(function() {
    CheckVisible();    
    saveAllParam();
});

$('.kizou_check').click(function() {
    CheckVisible(); 
    saveAllParam();
});

$('#tab_sakana').click(function(){
    $('#main_sakana').show();
    $('#main_mushi').hide();
    $('#main_kaisan').hide();
});

$('#tab_mushi').click(function(){
    $('#main_sakana').hide();
    $('#main_mushi').show();
    $('#main_kaisan').hide();
});

$('#tab_kaisan').click(function(){
    $('#main_sakana').hide();
    $('#main_mushi').hide();
    $('#main_kaisan').show();
});

$('#cacheclear').click(function() {
    alert("保存してあるデータを削除します");
    store.clearAll();
    location.reload();
});

// 表示月切り替え。
$('.change_month').click(function() {
    // 表示月変更。
    nowMonth = Number($(this).attr("value"));

    initialize();
});
